In [1]:
import pandas as pd

# Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [3]:
df = pd.read_csv('ratings.csv')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27753444 entries, 0 to 27753443
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 847.0 MB

In [7]:
df.head()

   userId  movieId  rating   timestamp
0       1      307     3.5  1256677221
1       1      481     3.5  1256677456
2       1     1091     1.5  1256677471
3       1     1257     4.5  1256677460
4       1     1449     4.5  1256677264

In [14]:
df[df.rating==5.0].movieId.value_counts()

318       48762
296       37458
356       32009
260       31385
593       30280
          ...
116080        1
72537         1
82770         1
86864         1
152127        1
Name: movieId, Length: 24209, dtype: int64

In [ ]:
Answer: MovieId = 318 (48762)

# Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [15]:
pp = pd.read_csv('power.csv')
pp.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [22]:
pp[pp.country.str.contains('lat', case=False)]['country'].unique()

array(['Latvia'], dtype=object)

In [24]:
pp[pp.country.str.contains('lit', case=False)]['country'].unique()

array(['Lithuania'], dtype=object)

In [25]:
pp[pp.country.str.contains('est', case=False)]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [37]:
prib = pp[(pp.country=='Latvia')|(pp.country=='Lithuania')|(pp.country=='Estonia')]
prib = prib[prib.category.isin([4,12,21])]
prib = prib[prib.quantity >0]
prib = prib[prib.year.isin(['2005', '2006', '2007', '2008', '2009', '2010'])]
prib.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4

In [38]:
prib.quantity.sum()

240580.0

# Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [43]:
pd.read_html('https://fortrader.org/quotes')[1]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть (BRENT) Курс нефти сегодня,43.860,0.400,0.920,NaN
1,Нефть (WTI) Цены на нефть (WTI),40.740,0.580,1.440,NaN
2,Сахар котировки на сахар,12.630,11.300,849.620,NaN
3,Газ Цена на газ,2.091,0.234,12.601,NaN

In [54]:
pd.read_html('https://www.sports.ru/football/match/russia/')[1]

            0      1             2      3          4
0   8 августа  16:00         Химки  - : -       ЦСКА
1   8 августа  18:30        Тамбов  - : -     Ростов
2   9 августа  17:00           Уфа  - : -  Краснодар
3   9 августа  19:00  Арсенал Тула  - : -      Ахмат
4   9 августа  20:00       Спартак  - : -       Сочи
5  10 августа  17:00          Урал  - : -     Динамо
6  11 августа  18:00         Ротор  - : -      Зенит
7  11 августа  20:00         Рубин  - : -  Локомотив